vladBaciu/ILSF/src/max3010_psoc6_hospital/PSOC_PPG.cydsn/codegentemp/I2C_MAX30105.h
/** The number of Component clocks used by the master to generate the SCL
* high phase. This number is calculated by GUI based on the selected data rate.
*/
#define I2C_MAX30105_HIGH_PHASE_DUTY_CYCLE  (8U)
/** @} group_macros */


/***************************************
*    In-line Function Implementation
***************************************/

/*******************************************************************************
* Function Name: I2C_MAX30105_Init
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_Init() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_i2c_status_t I2C_MAX30105_Init(cy_stc_scb_i2c_config_t const *config)
{
    return Cy_SCB_I2C_Init(I2C_MAX30105_HW, config, &I2C_MAX30105_context);
}


/*******************************************************************************
*  Function Name: I2C_MAX30105_DeInit
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_DeInit() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_MAX30105_DeInit(void)
{
    Cy_SCB_I2C_DeInit(I2C_MAX30105_HW);
}


/*******************************************************************************
* Function Name: I2C_MAX30105_Enable
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_Enable() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_MAX30105_Enable(void)
{
    Cy_SCB_I2C_Enable(I2C_MAX30105_HW);
}


/*******************************************************************************
* Function Name: I2C_MAX30105_Disable
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_Disable() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_MAX30105_Disable(void)
{
    Cy_SCB_I2C_Disable(I2C_MAX30105_HW, &I2C_MAX30105_context);
}


/*******************************************************************************
* Function Name: I2C_MAX30105_SetDataRate
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SetDataRate() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_MAX30105_SetDataRate(uint32_t dataRateHz, uint32_t scbClockHz)
{
    return Cy_SCB_I2C_SetDataRate(I2C_MAX30105_HW, dataRateHz, scbClockHz);
}


/*******************************************************************************
* Function Name: I2C_MAX30105_GetDataRate
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_GetDataRate() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_MAX30105_GetDataRate(uint32_t scbClockHz)
{
    return Cy_SCB_I2C_GetDataRate(I2C_MAX30105_HW, scbClockHz);
}


/*******************************************************************************
* Function Name: I2C_MAX30105_RegisterEventCallback
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_RegisterEventCallback() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_MAX30105_RegisterEventCallback(cy_cb_scb_i2c_handle_events_t callback)
{
    Cy_SCB_I2C_RegisterEventCallback(I2C_MAX30105_HW, callback, &I2C_MAX30105_context);
}


#if (I2C_MAX30105_ENABLE_SLAVE)
/*******************************************************************************
* Function Name: I2C_MAX30105_RegisterAddrCallback
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_RegisterAddrCallback() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_MAX30105_RegisterAddrCallback(cy_cb_scb_i2c_handle_addr_t callback)
{
    Cy_SCB_I2C_RegisterAddrCallback(I2C_MAX30105_HW, callback, &I2C_MAX30105_context);
}
#endif /* (I2C_MAX30105_ENABLE_SLAVE) */


/*******************************************************************************
* Function Name: I2C_MAX30105_IsBusBusy
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_IsBusBusy() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE bool I2C_MAX30105_IsBusBusy(void)
{
    return Cy_SCB_I2C_IsBusBusy(I2C_MAX30105_HW);
}


#if (I2C_MAX30105_ENABLE_SLAVE)
/*******************************************************************************
* Function Name: I2C_MAX30105_SlaveSetAddress
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveGetAddress() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_MAX30105_SlaveSetAddress(uint8_t addr)
{
    Cy_SCB_I2C_SlaveSetAddress(I2C_MAX30105_HW, addr);
}


/*******************************************************************************
* Function Name: I2C_MAX30105_SlaveGetAddress
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveGetAddress() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_MAX30105_SlaveGetAddress(void)
{
    return Cy_SCB_I2C_SlaveGetAddress(I2C_MAX30105_HW);
}


/*******************************************************************************
* Function Name: I2C_MAX30105_SlaveSetAddressMask
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveSetAddressMask() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_MAX30105_SlaveSetAddressMask(uint8_t addrMask)
{
    Cy_SCB_I2C_SlaveSetAddressMask(I2C_MAX30105_HW, addrMask);
}


