vladBaciu/ILSF/src/max3010_psoc6_hospital/PSOC_PPG.cydsn/codegentemp/I2C_MAX30105.h
/*******************************************************************************
* Function Name: I2C_MAX30105_SlaveGetAddressMask
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveGetAddressMask() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_MAX30105_SlaveGetAddressMask(void)
{
    return Cy_SCB_I2C_SlaveGetAddressMask(I2C_MAX30105_HW);
}
#endif /* (I2C_MAX30105_ENABLE_SLAVE) */

#if (I2C_MAX30105_ENABLE_MASTER)
/*******************************************************************************
* Function Name: I2C_MAX30105_MasterSetLowPhaseDutyCycle
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterSetLowPhaseDutyCycle() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_MAX30105_MasterSetLowPhaseDutyCycle(uint32_t clockCycles)
{
    Cy_SCB_I2C_MasterSetLowPhaseDutyCycle(I2C_MAX30105_HW, clockCycles);
}


/*******************************************************************************
* Function Name: I2C_MAX30105_MasterSetHighPhaseDutyCycle
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterSetHighPhaseDutyCycle() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_MAX30105_MasterSetHighPhaseDutyCycle(uint32_t clockCycles)
{
    Cy_SCB_I2C_MasterSetHighPhaseDutyCycle(I2C_MAX30105_HW, clockCycles);
}
#endif /* (I2C_MAX30105_ENABLE_MASTER) */


#if (I2C_MAX30105_ENABLE_SLAVE)
/*******************************************************************************
* Function Name: I2C_MAX30105_SlaveGetStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveGetStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_MAX30105_SlaveGetStatus(void)
{
    return Cy_SCB_I2C_SlaveGetStatus(I2C_MAX30105_HW, &I2C_MAX30105_context);
}


/*******************************************************************************
* Function Name: I2C_MAX30105_SlaveConfigReadBuf
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveConfigReadBuf() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_MAX30105_SlaveConfigReadBuf(uint8_t *buffer, uint32_t size)
{
    Cy_SCB_I2C_SlaveConfigReadBuf(I2C_MAX30105_HW, buffer, size, &I2C_MAX30105_context);
}


/*******************************************************************************
* Function Name: I2C_MAX30105_SlaveAbortRead
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveAbortRead() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_MAX30105_SlaveAbortRead(void)
{
    Cy_SCB_I2C_SlaveAbortRead(I2C_MAX30105_HW, &I2C_MAX30105_context);
}


/*******************************************************************************
* Function Name: I2C_MAX30105_SlaveGetReadTransferCount
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveGetReadTransferCount() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_MAX30105_SlaveGetReadTransferCount(void)
{
    return Cy_SCB_I2C_SlaveGetReadTransferCount(I2C_MAX30105_HW, &I2C_MAX30105_context);
}


/*******************************************************************************
* Function Name: I2C_MAX30105_SlaveClearReadStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveClearReadStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_MAX30105_SlaveClearReadStatus(void)
{
    return Cy_SCB_I2C_SlaveClearReadStatus(I2C_MAX30105_HW, &I2C_MAX30105_context);
}


/*******************************************************************************
* Function Name: I2C_MAX30105_SlaveConfigWriteBuf
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveConfigWriteBuf() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_MAX30105_SlaveConfigWriteBuf(uint8_t *buffer, uint32_t size)
{
    Cy_SCB_I2C_SlaveConfigWriteBuf(I2C_MAX30105_HW, buffer, size, &I2C_MAX30105_context);
}


/*******************************************************************************
* Function Name: I2C_MAX30105_SlaveAbortWrite
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveAbortWrite() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_MAX30105_SlaveAbortWrite(void)
{
    Cy_SCB_I2C_SlaveAbortWrite(I2C_MAX30105_HW, &I2C_MAX30105_context);
}


/*******************************************************************************
* Function Name: I2C_MAX30105_SlaveGetWriteTransferCount
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveGetWriteTransferCount() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_MAX30105_SlaveGetWriteTransferCount(void)
{
    return Cy_SCB_I2C_SlaveGetWriteTransferCount(I2C_MAX30105_HW, &I2C_MAX30105_context);
}


/*******************************************************************************
* Function Name: I2C_MAX30105_SlaveClearWriteStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveClearWriteStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_MAX30105_SlaveClearWriteStatus(void)
{
    return Cy_SCB_I2C_SlaveClearWriteStatus(I2C_MAX30105_HW, &I2C_MAX30105_context);
}
#endif /* (I2C_MAX30105_ENABLE_SLAVE) */


#if (I2C_MAX30105_ENABLE_MASTER)
/*******************************************************************************
* Function Name: I2C_MAX30105_MasterGetStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterGetStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_MAX30105_MasterGetStatus(void)
{
    return Cy_SCB_I2C_MasterGetStatus(I2C_MAX30105_HW, &I2C_MAX30105_context);
}


